Autodesk.Revit.DB.UpdaterRegistry.GetRegisteredUpdaterInfos
Returns UpdaterInfos for all the application-wide updaters.
Returns:
List of UpdaterInfo structures
Since:
2011

Autodesk.Revit.DB.UpdaterRegistry.GetRegisteredUpdaterInfos(Autodesk.Revit.DB.Document)
Returns information about all updaters applicable to the given document.
Remarks:
The list of data includes information about all updaters explicitly registered
for the document as well as information about all application-wide registered
updaters (which are applicable to all documents).
document:
The document to which sought updaters are applicable to.
Returns:
List of UpdaterInfo structures
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.UpdaterRegistry.IsUpdaterEnabled(Autodesk.Revit.DB.UpdaterId)
Checks if the updater is enabled or not.
Remarks:
Even when an updater is enabled it could still be suspended for misbehaving, in which case it would not
be executed regardless of its enable/disable status.
id:
The updater id.
Returns:
Returns true if the updater is enabled, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Updater with this Id is not currently registered in Revit.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.UpdaterRegistry.DisableUpdater(Autodesk.Revit.DB.UpdaterId)
Disables the updater.
id:
The updater id.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Updater with this Id is not currently registered in Revit.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.UpdaterRegistry.EnableUpdater(Autodesk.Revit.DB.UpdaterId)
Enables the updater.
Remarks:
Even when an updater is enabled it could still be suspended for misbehaving, in which case it would not
be executed regardless of its enable/disable status.
id:
The updater id.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Updater with this Id is not currently registered in Revit.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.UpdaterRegistry.SetIsUpdaterOptional(Autodesk.Revit.DB.UpdaterId,System.Boolean)
Sets a flag indicating whether an updater is optional or not.
Remarks:
This flag controls whether an updater is going to be required next time a document in which
it had been used is opened. If a non-optional updater is not found (currently not registered)
in a document, the end user will be presented with a warning and choices to resolve
the situation.
id:
Id of the updater
isOptional:
Use True to make the updater optional, false to make it a mandatory updater.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Updater with this Id is not currently registered in Revit.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.UpdaterRegistry.GetIsUpdaterOptional(Autodesk.Revit.DB.UpdaterId)
Check if the updater is optional or not.
Remarks:
This flag controls whether an updater is going to be required next time a document in which
it had been used is opened. If a non-optional updater is not found (currently not registered)
in a document, the end user will be presented with a warning and choices to resolve
the situation.
id:
Id of the updater to check
Returns:
Returns True if the updater is optional, False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Updater with this Id is not currently registered in Revit.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.UpdaterRegistry.RemoveDocumentTriggers(Autodesk.Revit.DB.UpdaterId,Autodesk.Revit.DB.Document)
Removes all triggers associated with specified document and Updater
Does not unregister updater.
id:
Id of specified updater
document:
Document for which to remove triggers
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The updater's owner's AddIn does not match the currently active AddIn.
-or-
RemoveDocumentTriggers called while executing an updater.
Since:
2011

Autodesk.Revit.DB.UpdaterRegistry.RemoveAllTriggers(Autodesk.Revit.DB.UpdaterId)
Removes all triggers associated with Updater with specified UpdaterId.
Does not unregister updater.
id:
Id of specified updater
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The updater's owner's AddIn does not match the currently active AddIn.
-or-
RemoveAllTriggers called while executing an updater.
Since:
2011

Autodesk.Revit.DB.UpdaterRegistry.AddTrigger(Autodesk.Revit.DB.UpdaterId,Autodesk.Revit.DB.ElementFilter,Autodesk.Revit.DB.ChangeType)
Adds trigger with the specified element filter and ChangeType for all documents associated with this Updater
Remarks:
This method only works with CategoryFilter and ParameterFilter.
id:
Id of updater that trigger should be added to
filter:
Element filter that defines elements that affect this trigger
change:
ChangeType associated with this trigger
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The updater's owner's AddIn does not match the currently active AddIn.
-or-
The id does not correspond to any registered Updaters.
-or-
AddTrigger called while executing an updater.
Since:
2011

Autodesk.Revit.DB.UpdaterRegistry.AddTrigger(Autodesk.Revit.DB.UpdaterId,Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementFilter,Autodesk.Revit.DB.ChangeType)
Adds trigger with the specified element filter and ChangeType for the specified document
Remarks:
This method only works with CategoryFilter and ParameterFilter.
id:
Id of updater that trigger should be added to
document:
Document that elements in 'elements' are contained in
filter:
Element filter that defines elements that affect this trigger
change:
ChangeType associated with this trigger
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The updater's owner's AddIn does not match the currently active AddIn.
-or-
The id does not correspond to any registered Updaters
-or-
AddTrigger called while executing an updater.
Since:
2011

Autodesk.Revit.DB.UpdaterRegistry.AddTrigger(Autodesk.Revit.DB.UpdaterId,Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.ChangeType)
Adds a trigger to an updater with specified set of elements and ChangeType
id:
Id of updater that trigger should be added to
document:
Document that elements in 'elements' are contained in
elements:
Set of elements which define this trigger
change:
ChangeType associated with this trigger
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
updater's owner AddIn does not match the currently active AddIn
-or-
id does not correspond to any registered Updaters
-or-
AddTrigger called while executing an updater.
Since:
2011

Autodesk.Revit.DB.UpdaterRegistry.SetExecutionOrder(Autodesk.Revit.DB.UpdaterId,Autodesk.Revit.DB.UpdaterId)
Forces execution order between two updaters
Execution order: first before second
first:
Id of first Updater
second:
Id of second Updater
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or both inputs are not valid UpdaterIds
-or-
One or both of the Updaters are not registered
-or-
first and second are the same id
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The updaters do not report the same ChangePriority
Since:
2011

Autodesk.Revit.DB.UpdaterRegistry.IsUpdaterRegistered(Autodesk.Revit.DB.UpdaterId,Autodesk.Revit.DB.Document)
Checks whether updater with the given id is registered in a document.
id:
Id of the updater being tested.
document:
Document in which this updater is tested whether it's registered or not.
Returns:
Returns True if the updater is registered in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.UpdaterRegistry.IsUpdaterRegistered(Autodesk.Revit.DB.UpdaterId)
Checks whether updater with the given id is registered
id:
Id of the updater being tested.
Returns:
Returns true if the updater is registered.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.UpdaterRegistry.UnregisterUpdater(Autodesk.Revit.DB.UpdaterId,Autodesk.Revit.DB.Document)
Unregisters an updater for the given document.
Remarks:
Unregistering an updater from a document is only permitted if
the updater was explicitly registered for that document.
If the updater was registered in other documents too,
the remaining documents will still have the updater assigned.
However, if after unregistering from the document the updater is found
not registered in any other (currently open) documents, the updater
will be completely removed from the registry including its triggers.
Should the updater be registered again later, the triggers need
to be re-applied.
id:
Id of updater to be unregistered.
document:
Document for which this updater is to be unregistered.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Updater with this Id is not currently registered in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The updater's owner's AddIn does not match the currently active AddIn,
i.e. IUpdater.GetUpdaterId().GetAddInId() differs from the addInId field
in the manifest file of the currently executing external application.
-or-
Attempting to unregister an updater that is currently being executed.
Since:
2014

Autodesk.Revit.DB.UpdaterRegistry.UnregisterUpdater(Autodesk.Revit.DB.UpdaterId)
Removes the updater associated with the input id from the UpdaterRegistry.
Also removes all triggers associated with the Updater.
Remarks:
This methods works regardless of how the updater was registered.
Whether the updater was registered application-wide or for a document
(or a set of document), it will be removed from the registry and
any connections with documents will also be lost.
id:
Id of updater to be removed
Throws Autodesk.Revit.Exceptions.ArgumentException:
Updater with this Id is not currently registered in Revit.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The updater's owner's AddIn does not match the currently active AddIn,
i.e. IUpdater.GetUpdaterId().GetAddInId() differs from the addInId field
in the manifest file of the currently executing external application.
-or-
Attempting to unregister an updater that is currently being executed.
Since:
2011

Autodesk.Revit.DB.UpdaterRegistry.RegisterUpdater(Autodesk.Revit.DB.IUpdater,Autodesk.Revit.DB.Document,System.Boolean)
Registers the updater for a specified document, which means
the updater can only be triggered by changes made in that document.
Remarks:
An updater may be registered in more then one document, but an updater
may not be registered for a document and also for the entire application at
the same time. If an updater has already been registered application-wide,
an attempt to register it for a document will cause an exception.
updater:
Updater to be registered.
document:
Document for which this updater is to be registered.
isOptional:
This argument controls whether the updater should be required next time a document
is open in which the updater had been previously used. If a non-optional updater is
not found (i.e. currently not registered), the end user will be presented with a warning
and choices to resolve the situation.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Updater with the the same Id has already been registered on the application level.
-or-
Updater with the the same Id has already been registered either in the given document or on the application level.
-or-
Updater's Id is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Method is not allowed during execution of a dynamic update.
-or-
The updater's owner's AddIn does not match the currently active AddIn,
i.e. IUpdater.GetUpdaterId().GetAddInId() differs from the addInId field
in the manifest file of the currently executing external application.
Since:
2011

Autodesk.Revit.DB.UpdaterRegistry.RegisterUpdater(Autodesk.Revit.DB.IUpdater,System.Boolean)
Registers an updater application-wide, which means
the updater may get triggered in any open document.
Remarks:
By registering an updater application-wide, any previous registration explicitly made
for particular documents will be voided. That means the updater will no longer be connected
with just those documents, and the methodIsUpdaterRegistered(id,document) will also
return False. Consequently, any attempt to either register or unregister this updater
to (or from, respectively) a document will cause an exception to be thrown.
updater:
Updater to be registered
isOptional:
This argument controls whether the updater should be required next time a document
is open in which the updater had been previously used. If a non-optional updater is
not found (i.e. currently not registered), the end user will be presented with a warning
and choices to resolve the situation.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Updater with the the same Id has already been registered on the application level.
-or-
Updater's Id is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Method is not allowed during execution of a dynamic update.
-or-
The updater's owner's AddIn does not match the currently active AddIn,
i.e. IUpdater.GetUpdaterId().GetAddInId() differs from the addInId field
in the manifest file of the currently executing external application.
Since:
2011

Autodesk.Revit.DB.UpdaterRegistry.RegisterUpdater(Autodesk.Revit.DB.IUpdater,Autodesk.Revit.DB.Document)
Registers the updater for a specified document, which means
the updater can only be triggered by changes made in that document.
Remarks:
An updater may be registered in more than one document, but an updater
may not be registered for a document and also for the entire application at
the same time. If an updater has already been registered application-wide,
an attempt to register it for a document will cause an exception.
updater:
Updater to be registered
document:
Document for which this updater is to be registered
Throws Autodesk.Revit.Exceptions.ArgumentException:
Updater with the the same Id has already been registered on the application level.
-or-
Updater with the the same Id has already been registered either in the given document or on the application level.
-or-
Updater's Id is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Method is not allowed during execution of a dynamic update.
-or-
The updater's owner's AddIn does not match the currently active AddIn,
i.e. IUpdater.GetUpdaterId().GetAddInId() differs from the addInId field
in the manifest file of the currently executing external application.
Since:
2011

Autodesk.Revit.DB.UpdaterRegistry.RegisterUpdater(Autodesk.Revit.DB.IUpdater)
Registers an updater application-wide, which means
the updater may get triggered in any open document.
Remarks:
By registering an updater application-wide, any previous registration explicitly made
for particular documents will be voided. That means the updater will no longer be connected
with just those documents, and the methodIsUpdaterRegistered(id,document) will also
return False. Consequently, any attempt to either register or unregister this updater
to (or from, respectively) a document will cause an exception to be thrown.
updater:
Updater to be registered
Throws Autodesk.Revit.Exceptions.ArgumentException:
Updater with the the same Id has already been registered on the application level.
-or-
Updater's Id is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Method is not allowed during execution of a dynamic update.
-or-
The updater's owner's AddIn does not match the currently active AddIn,
i.e. IUpdater.GetUpdaterId().GetAddInId() differs from the addInId field
in the manifest file of the currently executing external application.
Since:
2011

Autodesk.Revit.DB.UpdaterRegistry.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.UpdaterRegistry
An object that stores and manages all updaters registered in the current session.
Remarks:
The registry is an application-wide singleton. It maintains all dynamic
updaters currently registered, and also invokes them per their respective
trigger condition during subsequent transactions.
Please note that only the application (an add-in, typically) which registered
an updater is allowed to modify it later, including unregistering it.
Also, an application is not allowed to register an updater with an Id,
that is based on another application's Id.
Since:
2011